# Отчёт о тестировании внедрение дополнительного бонуса новым клиентам


**Краткое описание**

- Дата тестирования: <30/10/2020> - <30/10/2020>
- Время затраченное на тестирование: 3ч.
- В программе IntelliJ IDEA создано базовое приложения для воспроизведения следующей ситуации:    
проверка работоспособности кода
- Проведено функциональное тестирования



## Описание процесса тестирования

**В процессе тестирования использовались следующие артефакты:**

- Отчет о тестировании

- Баг Репорты (Issues)


В качестве тестовых данных использовались данные - Домашнего задания к занятию «1.2. Программирование на Java: 
переменные, операторы, работа с отладчиком»

*Входные данные:*

Код:

``public class Main {
   public static void main(String[] args) {
     double regularBonus = 0.3;
     double specialBonus = 0.6;
     double totalBonus = regularBonus + specialBonus;
     System.out.println(totalBonus);
   }
 }``


**Ожидаемый и фактический результат тестирования**

 Отображение вывода записи в переменной для хранения итогового значения
 
 - ожидаемый результат:  успешно
 - фактический результат: выявлена ошибка
 
 При суммировании значений возникли проблемы связанные с некорректным отображеним вывода.
 
 **В результате тестирования выявлены следующие дефекты:**
 
[ ]()
 
 
**Тестирование производилось в следующем окружении:**

- Версия и разрядность ОС: Windows 10, версия -1703, сборка ОС 15063.0, процессор х64 
- Версия Java: "11.0.9"
- IntelliJ IDEA